---
title: PostPattern
classe: Autodesk.Revit.DB.Architecture.PostPattern
namespace: Autodesk.Revit.DB.Architecture
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# PostPattern

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `BalusterInfo CornerPost { get; }` | `postPattern.CornerPost` | BalusterInfo |
| `Double CornerPostAngle { get; set; }` | `postPattern.CornerPostAngle` | Double |
| `BreakCornerCondition CornerPostCondition { get; set; }` | `postPattern.CornerPostCondition` | BreakCornerCondition |
| `BalusterInfo EndPost { get; }` | `postPattern.EndPost` | BalusterInfo |
| `Boolean IsValidObject { get; }` | `postPattern.IsValidObject` | Boolean |
| `BalusterInfo StartPost { get; }` | `postPattern.StartPost` | BalusterInfo |
| `Void Dispose()` | `postPattern.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```